perf/pico.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    node2:
      target: 'http://localhost:5555/node_replicated'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node-replicated"
    gunicorn:
      target: 'http://localhost:5555/gunicorn'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery_gunicorn"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Normal
      duration: 120
      arrivalRate: 200
    - name: Pico
      duration: 120
      arrivalRate: 600
    - name: Normal
      duration: 120
      arrivalRate: 150

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/'